{
  "education": [
    {
      "awards_achievements": [
        "Completed dual postgraduate programs with Honours",
        "Built AI and data applications: AI Career Advisor, Sustainable Healthcare, Fraud Detection",
        "Graduated with Honours - GPA: 4.5/5.0"
      ],
      "degree": "Postgraduate Diplomas",
      "department": "Artificial Intelligence and Data Analytics for Business",
      "duration": "Jan 2024 - Aug 2025",
      "school_name": "Durham College"
    },
    {
      "awards_achievements": [
        "Designed and built a semi-automatic staircase climbing trolley for load transport using motorized mechanisms",
        "Presented at College Technical Expo for innovation and practical design",
        "Graduated with First Class - CGPA: 8/10"
      ],
      "degree": "Bachelor of Engineering",
      "department": "Mechanical Engineering",
      "duration": "Aug 2017 - Aug 2021",
      "school_name": "Anna University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_SridharRaviKumar",
  "highlighted_projects": [
    {
      "description": "Designed a simple meal-planning application that recommends food options based on user preferences. Built basic automation features such as calorie-range filters and dynamic meal suggestions. Explored the use of AI-assisted components to improve recommendations and experimented with lightweight deployment using AWS and containerized workflows. Focused on building a clean user flow, responsive interface, and easy-to-maintain backend structure.",
      "git_url": "https://github.com/sridhoo/",
      "name": "FitEats AI Meal Planner"
    },
    {
      "description": "Developed an end-to-end reporting dashboard to help track sales performance across regions. Migrated manual Excel reports into Power BI, enabling automated data refresh and clear KPI visualizations. Organized departmental sales data into structured tables, cleaned inconsistencies, and added filters for month-wise, category-wise, and location-based insights. Improved reporting accuracy and reduced manual workload by converting recurring tasks into a scheduled, reliable dashboard.",
      "git_url": "https://github.com/sridhoo/",
      "name": "Sales Performance Dashboard"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Built at Jarvis Consulting Group. Developed a Bash-based monitoring tool to collect hardware specs and usage data from Linux machines. Designed the PostgreSQL schema, created tables for host and usage data, and containerized the database using Docker. Automated continuous data collection with Cron and wrote SQL queries to analyze system performance and trends.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Designed and implemented relational schemas to analyze system metrics collected from Linux hosts.Wrote optimized SQL using joins, aggregations, subqueries, and window functions to extract performance insights.Automated data loading and validation inside a Dockerized PostgreSQL environment using Bash.",
      "git_url": "/sql",
      "name": "SQL Data Analytics and Modeling"
    }
  ],
  "name": "Sridhar Ravi Kumar",
  "others": [
    {
      "bullets": [
        "**Key Speaker:** Delivered sessions on freelancing and superbikes for high-school students"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "**Freelance Technical Roles:** Worked in exam administration, digital content handling, network assistance, and technical support across multiple organizations"
      ],
      "title": "Freelance Experience"
    },
    {
      "bullets": [
        "**Travel \u0026 Engineering Enthusiast:** Enjoy exploring new places and understanding the mechanics behind motorcycles and machines",
        "**Volunteer:** Cognizant Outreach"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "Worked on data engineering projects using Linux, Bash, SQL, Docker, and PostgreSQL. Built scripts to collect and store system metrics, designed data models, and automated recurring tasks using Cron. Collaborated in Agile sprints, maintained clean repositories using Git, and followed structured processes for testing and documentation.",
      "duration": "2025 - Present",
      "title": "Data Engineer"
    },
    {
      "company": "Cognizant Technology Solutions",
      "description": "Supported downstream data applications and reporting workflows. Automated monthly data processing tasks using SQL and scripting, reducing manual effort and improving accuracy. Created KPI reports, collaborated across teams, and wrote clear documentation for recurring processes.",
      "duration": "Apr 2022 - Nov 2023",
      "title": "Programmer Analyst"
    }
  ],
  "skills": {
    "competent": [
      "Power BI and Tableau",
      "Docker (Containerization)",
      "Basic Data Modeling and ETL Concepts",
      "API Integration (Foundational Experience)",
      "AWS EC2 (Deployment Basics)"
    ],
    "familiar": [
      "Microsoft Excel",
      "R programming",
      "N8N automation workflows",
      "LLM tools and prompt workflows",
      "Data warehouse and analytics concepts"
    ],
    "proficient": [
      "Java, COBOL",
      "Linux/Bash Command Line",
      "RDBMS/SQL (PostgreSQL, MySQL)",
      "Git and Version Control",
      "Agile/Scrum"
    ]
  },
  "summary": "Data Engineering professional with hands-on experience building monitoring, automation, and database solutions at Jarvis Consulting Group. At Jarvis, I worked with Linux, Bash, Docker, PostgreSQL, and SQL to collect system metrics, organize data, and automate updates using Cron. My background also includes reporting automation and data processing experience from Cognizant, along with dual postgraduate diplomas in AI and Data Analytics from Durham College. I enjoy solving practical problems, writing simple and reliable scripts, and working in environments where clarity, structure, and continuous improvement are valued."
}
