{
  "education": [
    {
      "awards_achievements": [
        "Completed dual postgraduate programs with Honours",
        "Built AI and data applications: AI Career Advisor, Sustainable Healthcare, Fraud Detection",
        "GPA: 4.5/5.0"
      ],
      "degree": "Postgraduate Diplomas",
      "department": "Artificial Intelligence and Data Analytics for Business",
      "duration": "Jan 2024 - Aug 2025",
      "school_name": "Durham College"
    },
    {
      "awards_achievements": [
        "Designed and built a semi-automatic staircase climbing trolley for load transport using motorized mechanisms",
        "Presented at College Technical Expo for innovation and practical design",
        "Graduated with First Class - GPA: 8/10"
      ],
      "degree": "Bachelor of Engineering",
      "department": "Mechanical Engineering",
      "duration": "Aug 2017 - Aug 2021",
      "school_name": "Anna University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_SridharRaviKumar",
  "highlighted_projects": [
    {
      "description": "Developed a personalized meal planning web app with AI-driven recommendations and deployed on AWS using Docker and CI/CD.",
      "git_url": "https://github.com/sridhoo/",
      "name": "FitEats AI Meal Planner"
    },
    {
      "description": "Migrated executive reporting from Excel to Power BI, enabling automated refresh and KPI tracking across regions.",
      "git_url": "https://github.com/sridhoo/",
      "name": "Sales Performance Dashboard"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed and implemented relational schemas to analyze system metrics collected from Linux hosts.Wrote optimized SQL using joins, aggregations, subqueries, and window functions to extract performance insights.Automated data loading and validation inside a Dockerized PostgreSQL environment using Bash.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Designed and implemented relational schemas to analyze system metrics collected from Linux hosts.Wrote optimized SQL using joins, aggregations, subqueries, and window functions to extract performance insights.Automated data loading and validation inside a Dockerized PostgreSQL environment using Bash.",
      "git_url": "/sql",
      "name": "SQL Data Analytics and Modeling"
    }
  ],
  "name": "Sridhar Ravi Kumar",
  "others": [
    {
      "bullets": [
        "**Key Speaker:** Delivered a two-day webinar on 'How to Become a Freelancer' and 'Superbikes' for high school students"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "**Freelance Technical Roles:** Experience in exam operations, digital content management, network support, and tech support across multiple organizations"
      ],
      "title": "Freelance Experience"
    },
    {
      "bullets": [
        "**Motorcycle Enthusiast \u0026 AI Explorer:** Passion for engineering, mechanics, and automation tools",
        "**Volunteer:** Cognizant Outreach"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "Delivered end-to-end data engineering solutions using Python, SQL, Docker, and Linux within Agile sprints.Built ETL pipelines, automated data collection and reporting, and managed PostgreSQL in containerized environments.Collaborated with DevOps to implement CI/CD on AWS EC2 using GitHub Actions and improved system monitoring with Bash automation.",
      "duration": "2025 - Present",
      "title": "Data Engineer"
    },
    {
      "company": "Cognizant Technology Solutions",
      "description": "Developed downstream data applications achieving high first-release accuracy.Automated monthly performance reporting using Python and SQL to reduce delivery time, and produced KPI scorecards that improved operational decisions.Authored technical documentation and collaborated with cross-functional teams.",
      "duration": "Apr 2022 - Nov 2023",
      "title": "Programmer Analyst"
    }
  ],
  "skills": {
    "competent": [
      "Power BI / Tableau",
      "Docker / AWS EC2",
      "ETL pipeline design and data modeling",
      "Statistics and Predictive Modelling",
      "API integration and automation"
    ],
    "familiar": [
      "Microsoft Excel",
      "R",
      "N8N frameworks",
      "LLM",
      "Data warehouse and Analytics"
    ],
    "proficient": [
      "Java, Python and COBOL",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "Software and Data Engineering professional who has built scalable, data-driven solutions through the Jarvis Consulting Group Data Engineering program. Applied strong expertise in Python, SQL, Docker, and PostgreSQL to design and deploy analytics pipelines, automate workflows, and optimize database operations in Agile environments. Previously developed full-stack applications and machine learning models, transforming complex datasets into actionable business insights. Completed dual postgraduate diplomas in Artificial Intelligence and Data Analytics for Business at Durham College, building a solid foundation in data science and cloud technologies. Known for delivering clean, production-ready solutions, collaborating effectively in cross-functional teams, and continuously improving processes to meet client and organizational goals."
}
