000001    05 STUDENT-ID        PIC 9(4).
000002    05 STUDENT-NAME      PIC X(25).
000003    05 STUDENT-BIRTHDAY  PIC 9(8).
000004    05 STUDENT-COURSE    PIC X(16).
000005    05 STUDENT-INS-DATE  PIC 9(8).
000006    05 STUDENT-UPD-DATE  PIC 9(8).
