000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. PRGQ0006.
000003 AUTHOR. SRIDHAR.
000004*QUERY STUDENT BY ID FROM INDEXED FILE
000005 ENVIRONMENT DIVISION.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008     SELECT STUDENT-IDX-FILE
000009         ASSIGN TO "../indexed/STUDENTIDX.DAT"
000010         ORGANIZATION IS INDEXED
000011         ACCESS MODE IS DYNAMIC
000012         RECORD KEY IS STUDENT-ID OF IDX-STUDENT-REC
000013         FILE STATUS IS WS-IDX-STATUS.
000014
000015 DATA DIVISION.
000016 FILE SECTION.
000017
000018 FD STUDENT-IDX-FILE.
000019 01 IDX-STUDENT-REC.
000020 COPY "../copybooks/STUDENT.CPY".
000021
000022 WORKING-STORAGE SECTION.
000023 01 WS-IDX-STATUS      PIC XX VALUE SPACES.
000024 01 WS-INPUT-ID        PIC 9(4).
000025
000026 01 WS-DASH-LINE       PIC X(55).
000027
000028 01 WS-HEADER-LINE.
000029    05 FILLER          PIC X(5)  VALUE "ID   ".
000030    05 FILLER          PIC X(26)
000031       VALUE "NAME                      ".
000032    05 FILLER          PIC X(9)  VALUE "BDAY     ".
000033    05 FILLER          PIC X(15) VALUE "COURSE".
000034
000035 01 WS-REPORT-LINE.
000036    05 RPT-ID          PIC 9(4).
000037    05 FILLER          PIC X(1) VALUE SPACE.
000038    05 RPT-NAME        PIC X(25).
000039    05 FILLER          PIC X(1) VALUE SPACE.
000040    05 RPT-BDAY        PIC 9(8).
000041    05 FILLER          PIC X(1) VALUE SPACE.
000042    05 RPT-COURSE      PIC X(16).
000043
000044 PROCEDURE DIVISION.
000045 MAIN-PARA.
000046     MOVE ALL "-" TO WS-DASH-LINE.
000047
000048     DISPLAY WS-DASH-LINE.
000049     DISPLAY "QUERY STUDENT BY ID".
000050     DISPLAY WS-DASH-LINE.
000051
000052     OPEN INPUT STUDENT-IDX-FILE.
000053
000054     IF WS-IDX-STATUS NOT = "00"
000055         DISPLAY "OPEN ERROR STATUS: " WS-IDX-STATUS
000056         STOP RUN
000057     END-IF.
000058
000059     DISPLAY "ENTER STUDENT ID: ".
000060     ACCEPT WS-INPUT-ID.
000061
000062     MOVE WS-INPUT-ID TO STUDENT-ID OF IDX-STUDENT-REC.
000063
000064     READ STUDENT-IDX-FILE
000065         KEY IS STUDENT-ID OF IDX-STUDENT-REC
000066         INVALID KEY
000067             DISPLAY "STUDENT NOT FOUND: " WS-INPUT-ID
000068         NOT INVALID KEY
000069             DISPLAY WS-DASH-LINE
000070             DISPLAY "STUDENT FOUND"
000071             DISPLAY WS-DASH-LINE
000072             DISPLAY WS-HEADER-LINE
000073             DISPLAY WS-DASH-LINE
000074             MOVE SPACES TO WS-REPORT-LINE
000075             MOVE STUDENT-ID OF IDX-STUDENT-REC
000076                 TO RPT-ID
000077             MOVE STUDENT-NAME OF IDX-STUDENT-REC
000078                 TO RPT-NAME
000079             MOVE STUDENT-BIRTHDAY OF IDX-STUDENT-REC
000080                 TO RPT-BDAY
000081             MOVE STUDENT-COURSE OF IDX-STUDENT-REC
000082                 TO RPT-COURSE
000083             DISPLAY WS-REPORT-LINE
000084             DISPLAY WS-DASH-LINE
000085     END-READ.
000086
000087     CLOSE STUDENT-IDX-FILE.
000088
000089     GOBACK.
000090 END PROGRAM PRGQ0006.
